app/controllers/songs_controller.rb

  def update
    #binding.pry
    @song = Song.find(params[:id])
    if @song.artist
      @song.artist.update(name: song_params[:artist_name])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 11]]
UPDATE "artists" SET "name" = ?, "updated_at" = ? WHERE "artists"."id" = ?  [["name", "addd"], ["updated_at", "2016-08-18 23:07:12.766472"], ["id", 3]]
UPDATE "songs" SET "artist_id" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["artist_id", 6], ["updated_at", "2016-08-18 23:07:47.378604"], ["id", 11]]